"Long ago, when the valley was still young, a lone human found kinship with a Shadow... Together, they believed they would found an era of peace between our two species. Ha. No. Such a thing was the wishful thinking of a mind far too sincere. Now leave me, human. I do not wish to speak on this matter any further." - Skrell

Meet the cast of Diamond in the Rough, a rag-tag group of mis-fit weirdos coming to East Scarp sometime after the release of SDV 1.6! This mod will introduce a 7 major NPCs, 4 pet NPCs and a slow-burn storyline that takes place across them all. Several NPCs will be unlocked as the story plays out.

MAIN CAST
----
Trace - They/He - An elegant, bumbling baffoon who loves to cook and play the guitar. They are incredibly playful, silly and social- yet it seems neigh impossible to get close to them. What's going on in that head of theirs?

Eve - She/Her - Sassy yet sweet, Eve seems to have a million secrets. Always scurrying off into the mines or alluding to things that seem to make zero sense, she always seems to be up to something. But what?

Clyric - She/They - Hailing from Castle Village, Clyric is Eve's philanthropist twin sister who is completely incapable of telling lies. She appears rarely in the valley to visit her sister and assist her with... something. If you ask her, she'll tell you what's going on in a riddle. That isn't a lie, now is it?

Sen - He/Him - A Shadow guy who came from deep within the Valley's mines. Sen was always told by his elders that the surface world was a brutal and unfriendly place, but he wondered if that was the full truth. Looking for answers, he ventured to the surface.

Skrell - He/Him - Battered, war-torn and old, Skrell has little patience for those that do not listen. Deep down, however, he is quite the soft teddy-bear. What would it take to melt that hostile exterior?

Ebb - They/He - Quiet and reserved, Ebb is a Shadow of few words. They will only speak with those closest to them. They are always by Skrell's side, offering him emotional support and advice. "Also, they're literally a potato." - Trace

Diamond - She/Her - The character for which the mod is named and Sen's mother. Diamond is a gentle Shadow Brute who despises fighting. What happened to her, and where is she now? Depending on who you ask, you'll get a different answer... or be met with silence.

PETS
---

Waffle - She/Her - A weird dog with weird eyes. Waffle follows closely at Eve's heels, never far behind. She is incredibly friendly and will accept all the head pats.

Pipo - They/Them - A weird cat with weird eyes. Pipo is a stray cat who was abandoned for various unjustifiable reasons. They now wander the Valley, plotting against humanity.

Jeremy - Any - A species of giant invasive snail with exceptional intellegence that harbors deep existential dread. Once the farmer has recieved forest magic from the Wizard, they can visit Trace's basement to hear the wise words of Jeremy T. Snail. ...Or maybe the farmer's just hallucinating.

Cow - She/Her - Mischevious and playful, Cow is Clyric's pint-sized draconic familiar from Castle Village. Occasionally she will follow Clyric into the Valley on her visits to see her sister. Keep an eye on your belongings, or you may find them on fire.
---

*All art for DitR was created by me, with the exception of Jeremy, who was drawn by FellowClown!

*You can follow progress for the mod in the East Scarp discord in my chat, 7thAxis-Studios! In the pins you can also find the GitHub link to the pre-release alpha of DitR for SDV 1.6.

*Sen is from my current mod, Lurking in the Dark. He will be moved into DitR to streamline the modding process.

*Pipo has a different internal name than the Pipo in RSV, so there are no conflicts!